cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"


# Development
brew 'python'
brew 'cmake'
brew 'hugo'
brew 'git'
brew 'svn'
brew 'open-mpi'
brew 'zsh'
brew 'java11'
brew 'libomp'
brew 'clang-format'


# Applications
cask 'flux'
cask 'vlc'
cask 'mactex'
cask 'spectacle'
cask 'iterm2'
cask 'whatsapp'
cask 'signal'
cask 'slack'
cask 'mattermost'
cask 'jabref'
cask 'visual-studio-code'
cask 'presentation'
cask 'libreoffice'
cask 'paraview'
cask 'tunnelblick'
cask 'skype'
cask 'kap'
cask 'dropbox'
cask 'docker'
cask 'xquartz'

# Fonts
cask 'font-fira-code' 
cask 'font-fira-mono' 
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
