cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"


# Development
brew 'python'
brew 'cmake'
brew 'hugo'
brew 'git'
brew 'open-mpi'
brew 'zsh'


# Applications
cask 'flux'
cask 'vlc'
cask 'mactex'
cask 'spectacle'
cask 'iterm2'
cask 'whatsapp'
cask 'signal'
cask 'java11'
cask 'jabref'
cask 'visual-studio-code'
cask 'presentation'
cask 'nordvpn'
cask 'libreoffice'
cask 'paraview'
cask 'tunnelblick'


# Fonts
cask 'font-fira-code' 
cask 'font-fira-mono' 
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
